# Функция для подсчета суммы положительных чисел
def sum_positive_numbers(a, b,c):
    total = 0
    if a > 0:
        total += a
        if b > 0
        total += b
        if c > 0
        total =+ c
        return total
        
        #ввод трех чисел
     num1 = int(input("5:"))
     num2 = int(input("10:"))
     num3 = int(input("15:"))
     
     # Подсчет суммы положительных чисел 
     result = sum_positive_numbers(nym1, num2,num3)
     
     # Вывод результата
     print("30:"result)


# ДОБАВИТЬ: скопированный из терминала результат выполнения программы с собственными данными без изменений

# КОММЕНТАРИЙ: выполнение тестов своего кода с различными данными — тестирование — это обязательный этап разработки; копия результатов тестов в ответ — это требование, прописанное в задании — невыполнение требований задания влечёт снижение баллов

# КОММЕНТАРИЙ: в случае данной задачи, при попытках выполнения (тестировании) вы для начала столкнулись бы с множеством синтаксических ошибок — то есть этот код вообще не работает


# КОММЕНТАРИЙ: это задание не на функции, перечитайте ещё раз текст задания, начиная с заголовка; какую цель вы преследуете? похвастаться знанием функций? я пока не вижу, чтобы вы усвоили хотя бы то, что я рассказывал о литералах, переменных, операторах, выражениях, блоковых инструкциях, отступах, и так далее; иначе говоря: напишите сначала простейший код, как этого требует задание, без синтаксических ошибок — а потом уже и о функциях можно поговорить


# ИТОГ: 0/3

