name = input('введите имя:')
lastname = input('введите фамилию:')
date = int(input('введите год рождения:'))

print(name, lastname, ',', 2025-date)


# введите имя:Руслан
# введите фамилию: Надиров
# введите год рождения: 1988
# Руслан  Надиров , 36


# КОММЕНТАРИЙ: в каждой группе почему-то обязательно находится студент, который думает, что никто не заметит, если он возьмёт чужие файлы вместо самостоятельной практической работы

# КОММЕНТАРИЙ: как прямое следствие подобного отношения — дальнейшая деятельность таких студентов на курсе для меня перестаёт представлять какой бы то ни было интерес


# ИТОГ: 0/2

